[{"id":0,"Title":"Web app to perform chemical space analysis on chemical data","Links":["https://umap-learn.readthedocs.io/en/latest/","https://flask.palletsprojects.com/en/2.2.x/","https://getbootstrap.com/docs/5.3/getting-started/download/","https://reactjs.org/docs/getting-started.html","https://www.geeksforgeeks.org/nodejs/"],"Description":"A web application that allows users to upload a csv file containing chemical structures and their properties. The application then performs a chemical space analysis on the data and generates a 3D plot of the data. The user can then interact with the plot to explore the chemical space. The application is built using Flask, Plotly, React, Bootstrap, Node and umap.","Contributors":["Henric"],"Status":"To_Do","Github":"to be added","Difficulty":"Medium","Observations":["Previous way of doing this was using a Jupyter notebook. This was not ideal as it was not user friendly and required the user to have a Jupyter notebook installed. The new web application will be much more user friendly and will not require the user to have any software installed.","Furthermore, Previous reduction of dimensionality was done using PCA. This was not ideal as PCA is not a good method for dimensionality reduction of chemical data. The new web application will use umap for dimensionality reduction."],"Priority":"High"},{"id":1,"Title":"Web app to check and update this json file","Links":["https://www.geeksforgeeks.org/nodejs/","https://reactjs.org/docs/getting-started.html","https://getbootstrap.com/docs/5.3/getting-started/download/"],"Description":"A web application that allows users to check and update this json file. The application is built using React, Bootstrap, Node and umap.","Contributors":["Henric"],"Status":"Done","Github":"to be added","Difficulty":"Tutorial","Observations":"None","Priority":"High"},{"id":3,"Title":"Denuncia quilombola","Description":"Web app pra denunciar acontecimentos na comunidade quilombola\nUsar-se a react-native, react, node.js","Status":"To_Do","Links":["google.com","http://https://nodejs.org/en/","http://https://reactjs.org/"]},{"id":4,"Title":"Webscraper Platform","Description":"Generic Chemical data finder, accesible to chembl and pubchem","Status":"To_Do","Links":["http://google.com","http://https://www.freecodecamp.org/news/web-scraping-in-javascript-with-puppeteer/"]}]